Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/spi_ixs.h
/* -------- SPI_IXS_AUDCTRL : (SPI_IXS Offset: 0x10) (R/W 32) SPI Control Audio Register -------- */
#define SPI_IXS_AUDCTRL_RESETVALUE            _UINT32_(0x00)                                       /*  (SPI_IXS_AUDCTRL) SPI Control Audio Register  Reset Value */

#define SPI_IXS_AUDCTRL_AUDMOD_Pos            _UINT32_(0)                                          /* (SPI_IXS_AUDCTRL) Audio Protocol Mode Position */
#define SPI_IXS_AUDCTRL_AUDMOD_Msk            (_UINT32_(0x3) << SPI_IXS_AUDCTRL_AUDMOD_Pos)        /* (SPI_IXS_AUDCTRL) Audio Protocol Mode Mask */
#define SPI_IXS_AUDCTRL_AUDMOD(value)         (SPI_IXS_AUDCTRL_AUDMOD_Msk & (_UINT32_(value) << SPI_IXS_AUDCTRL_AUDMOD_Pos)) /* Assigment of value for AUDMOD in the SPI_IXS_AUDCTRL register */
#define   SPI_IXS_AUDCTRL_AUDMOD_STDMODE_Val  _UINT32_(0x0)                                        /* (SPI_IXS_AUDCTRL) I2S/I8S Standard Mode  */
#define   SPI_IXS_AUDCTRL_AUDMOD_LJRJMODE_Val _UINT32_(0x1)                                        /* (SPI_IXS_AUDCTRL) I2S/I8S Left Or Right Justified  */
#define   SPI_IXS_AUDCTRL_AUDMOD_PCMMODE_Val  _UINT32_(0x3)                                        /* (SPI_IXS_AUDCTRL) PCM/DSP Mode  */
#define SPI_IXS_AUDCTRL_AUDMOD_STDMODE        (SPI_IXS_AUDCTRL_AUDMOD_STDMODE_Val << SPI_IXS_AUDCTRL_AUDMOD_Pos) /* (SPI_IXS_AUDCTRL) I2S/I8S Standard Mode Position  */
#define SPI_IXS_AUDCTRL_AUDMOD_LJRJMODE       (SPI_IXS_AUDCTRL_AUDMOD_LJRJMODE_Val << SPI_IXS_AUDCTRL_AUDMOD_Pos) /* (SPI_IXS_AUDCTRL) I2S/I8S Left Or Right Justified Position  */
#define SPI_IXS_AUDCTRL_AUDMOD_PCMMODE        (SPI_IXS_AUDCTRL_AUDMOD_PCMMODE_Val << SPI_IXS_AUDCTRL_AUDMOD_Pos) /* (SPI_IXS_AUDCTRL) PCM/DSP Mode Position  */
#define SPI_IXS_AUDCTRL_AUDMONO_Pos           _UINT32_(3)                                          /* (SPI_IXS_AUDCTRL) Transmit audio data format Position */
#define SPI_IXS_AUDCTRL_AUDMONO_Msk           (_UINT32_(0x1) << SPI_IXS_AUDCTRL_AUDMONO_Pos)       /* (SPI_IXS_AUDCTRL) Transmit audio data format Mask */
#define SPI_IXS_AUDCTRL_AUDMONO(value)        (SPI_IXS_AUDCTRL_AUDMONO_Msk & (_UINT32_(value) << SPI_IXS_AUDCTRL_AUDMONO_Pos)) /* Assigment of value for AUDMONO in the SPI_IXS_AUDCTRL register */
#define SPI_IXS_AUDCTRL_AUDFMT_Pos            _UINT32_(4)                                          /* (SPI_IXS_AUDCTRL) Audio Protocol Format Position */
#define SPI_IXS_AUDCTRL_AUDFMT_Msk            (_UINT32_(0x7) << SPI_IXS_AUDCTRL_AUDFMT_Pos)        /* (SPI_IXS_AUDCTRL) Audio Protocol Format Mask */
#define SPI_IXS_AUDCTRL_AUDFMT(value)         (SPI_IXS_AUDCTRL_AUDFMT_Msk & (_UINT32_(value) << SPI_IXS_AUDCTRL_AUDFMT_Pos)) /* Assigment of value for AUDFMT in the SPI_IXS_AUDCTRL register */
#define   SPI_IXS_AUDCTRL_AUDFMT_I2SLEGACY_Val _UINT32_(0x0)                                        /* (SPI_IXS_AUDCTRL) Legacy I2S Mode  */
#define   SPI_IXS_AUDCTRL_AUDFMT_I2SRAW_Val   _UINT32_(0x1)                                        /* (SPI_IXS_AUDCTRL) I2S Raw Audio Format  */
#define   SPI_IXS_AUDCTRL_AUDFMT_I2SOTHER824_Val _UINT32_(0x2)                                        /* (SPI_IXS_AUDCTRL) I2S Other AM824 Format  */
#define   SPI_IXS_AUDCTRL_AUDFMT_I8SOTHER_Val _UINT32_(0x4)                                        /* (SPI_IXS_AUDCTRL) I8S Other Format  */
#define   SPI_IXS_AUDCTRL_AUDFMT_I8SRAW_Val   _UINT32_(0x5)                                        /* (SPI_IXS_AUDCTRL) I8S Raw Audio Format  */
#define   SPI_IXS_AUDCTRL_AUDFMT_I8SOTHER824_Val _UINT32_(0x6)                                        /* (SPI_IXS_AUDCTRL) I8S Other AM824 Format  */
#define SPI_IXS_AUDCTRL_AUDFMT_I2SLEGACY      (SPI_IXS_AUDCTRL_AUDFMT_I2SLEGACY_Val << SPI_IXS_AUDCTRL_AUDFMT_Pos) /* (SPI_IXS_AUDCTRL) Legacy I2S Mode Position  */
#define SPI_IXS_AUDCTRL_AUDFMT_I2SRAW         (SPI_IXS_AUDCTRL_AUDFMT_I2SRAW_Val << SPI_IXS_AUDCTRL_AUDFMT_Pos) /* (SPI_IXS_AUDCTRL) I2S Raw Audio Format Position  */
#define SPI_IXS_AUDCTRL_AUDFMT_I2SOTHER824    (SPI_IXS_AUDCTRL_AUDFMT_I2SOTHER824_Val << SPI_IXS_AUDCTRL_AUDFMT_Pos) /* (SPI_IXS_AUDCTRL) I2S Other AM824 Format Position  */
#define SPI_IXS_AUDCTRL_AUDFMT_I8SOTHER       (SPI_IXS_AUDCTRL_AUDFMT_I8SOTHER_Val << SPI_IXS_AUDCTRL_AUDFMT_Pos) /* (SPI_IXS_AUDCTRL) I8S Other Format Position  */
#define SPI_IXS_AUDCTRL_AUDFMT_I8SRAW         (SPI_IXS_AUDCTRL_AUDFMT_I8SRAW_Val << SPI_IXS_AUDCTRL_AUDFMT_Pos) /* (SPI_IXS_AUDCTRL) I8S Raw Audio Format Position  */
#define SPI_IXS_AUDCTRL_AUDFMT_I8SOTHER824    (SPI_IXS_AUDCTRL_AUDFMT_I8SOTHER824_Val << SPI_IXS_AUDCTRL_AUDFMT_Pos) /* (SPI_IXS_AUDCTRL) I8S Other AM824 Format Position  */
#define SPI_IXS_AUDCTRL_AUDWDMODE_Pos         _UINT32_(8)                                          /* (SPI_IXS_AUDCTRL) Serial Word Length bits (Ignored when AUDEN=0) Position */
#define SPI_IXS_AUDCTRL_AUDWDMODE_Msk         (_UINT32_(0x3) << SPI_IXS_AUDCTRL_AUDWDMODE_Pos)     /* (SPI_IXS_AUDCTRL) Serial Word Length bits (Ignored when AUDEN=0) Mask */
#define SPI_IXS_AUDCTRL_AUDWDMODE(value)      (SPI_IXS_AUDCTRL_AUDWDMODE_Msk & (_UINT32_(value) << SPI_IXS_AUDCTRL_AUDWDMODE_Pos)) /* Assigment of value for AUDWDMODE in the SPI_IXS_AUDCTRL register */
#define SPI_IXS_AUDCTRL_Msk                   _UINT32_(0x0000037B)                                 /* (SPI_IXS_AUDCTRL) Register Mask  */


/* -------- SPI_IXS_TPDCTRL : (SPI_IXS Offset: 0x14) (R/W 32) SPI Control Tpd Register -------- */
#define SPI_IXS_TPDCTRL_RESETVALUE            _UINT32_(0x00)                                       /*  (SPI_IXS_TPDCTRL) SPI Control Tpd Register  Reset Value */

#define SPI_IXS_TPDCTRL_PKFMT_Pos             _UINT32_(0)                                          /* (SPI_IXS_TPDCTRL) Master Slave TPD mode. Position */
#define SPI_IXS_TPDCTRL_PKFMT_Msk             (_UINT32_(0x7) << SPI_IXS_TPDCTRL_PKFMT_Pos)         /* (SPI_IXS_TPDCTRL) Master Slave TPD mode. Mask */
#define SPI_IXS_TPDCTRL_PKFMT(value)          (SPI_IXS_TPDCTRL_PKFMT_Msk & (_UINT32_(value) << SPI_IXS_TPDCTRL_PKFMT_Pos)) /* Assigment of value for PKFMT in the SPI_IXS_TPDCTRL register */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT4x32_Val   _UINT32_(0x0)                                        /* (SPI_IXS_TPDCTRL) 32 bit data in 4x32 packed format  */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT3x32_Val   _UINT32_(0x1)                                        /* (SPI_IXS_TPDCTRL) 32 bit data in 3x32 packed format  */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT4x24_Val   _UINT32_(0x2)                                        /* (SPI_IXS_TPDCTRL) 24 bit data in 4x24 packed format  */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT3x24_Val   _UINT32_(0x3)                                        /* (SPI_IXS_TPDCTRL) 24 bit data in 3x24 packed format  */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT6x16_Val   _UINT32_(0x4)                                        /* (SPI_IXS_TPDCTRL) 16 bit data in 6x16 packed format  */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT4x16_Val   _UINT32_(0x5)                                        /* (SPI_IXS_TPDCTRL) 16 bit data in 4x16 packed format  */
#define   SPI_IXS_TPDCTRL_PKFMT_PKT2x16_Val   _UINT32_(0x6)                                        /* (SPI_IXS_TPDCTRL) 16 bit data in 2x16 packed format  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT4x32         (SPI_IXS_TPDCTRL_PKFMT_PKT4x32_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 32 bit data in 4x32 packed format Position  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT3x32         (SPI_IXS_TPDCTRL_PKFMT_PKT3x32_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 32 bit data in 3x32 packed format Position  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT4x24         (SPI_IXS_TPDCTRL_PKFMT_PKT4x24_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 24 bit data in 4x24 packed format Position  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT3x24         (SPI_IXS_TPDCTRL_PKFMT_PKT3x24_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 24 bit data in 3x24 packed format Position  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT6x16         (SPI_IXS_TPDCTRL_PKFMT_PKT6x16_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 16 bit data in 6x16 packed format Position  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT4x16         (SPI_IXS_TPDCTRL_PKFMT_PKT4x16_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 16 bit data in 4x16 packed format Position  */
#define SPI_IXS_TPDCTRL_PKFMT_PKT2x16         (SPI_IXS_TPDCTRL_PKFMT_PKT2x16_Val << SPI_IXS_TPDCTRL_PKFMT_Pos) /* (SPI_IXS_TPDCTRL) 16 bit data in 2x16 packed format Position  */
#define SPI_IXS_TPDCTRL_SLVNUM_Pos            _UINT32_(8)                                          /* (SPI_IXS_TPDCTRL) Number of the Slave designated: to be used with the PKFMT to determine the slave. Position */
#define SPI_IXS_TPDCTRL_SLVNUM_Msk            (_UINT32_(0x7) << SPI_IXS_TPDCTRL_SLVNUM_Pos)        /* (SPI_IXS_TPDCTRL) Number of the Slave designated: to be used with the PKFMT to determine the slave. Mask */
#define SPI_IXS_TPDCTRL_SLVNUM(value)         (SPI_IXS_TPDCTRL_SLVNUM_Msk & (_UINT32_(value) << SPI_IXS_TPDCTRL_SLVNUM_Pos)) /* Assigment of value for SLVNUM in the SPI_IXS_TPDCTRL register */
#define   SPI_IXS_TPDCTRL_SLVNUM_SLAVE0_Val   _UINT32_(0x0)                                        /* (SPI_IXS_TPDCTRL) SLAVE 0  */
#define   SPI_IXS_TPDCTRL_SLVNUM_SLAVE1_Val   _UINT32_(0x1)                                        /* (SPI_IXS_TPDCTRL) SLAVE 1  */
#define   SPI_IXS_TPDCTRL_SLVNUM_SLAVE2_Val   _UINT32_(0x2)                                        /* (SPI_IXS_TPDCTRL) SLAVE 2  */
#define   SPI_IXS_TPDCTRL_SLVNUM_SLAVE3_Val   _UINT32_(0x3)                                        /* (SPI_IXS_TPDCTRL) SLAVE 3  */
#define   SPI_IXS_TPDCTRL_SLVNUM_SLAVE4_Val   _UINT32_(0x4)                                        /* (SPI_IXS_TPDCTRL) SLAVE 4  */
#define SPI_IXS_TPDCTRL_SLVNUM_SLAVE0         (SPI_IXS_TPDCTRL_SLVNUM_SLAVE0_Val << SPI_IXS_TPDCTRL_SLVNUM_Pos) /* (SPI_IXS_TPDCTRL) SLAVE 0 Position  */
#define SPI_IXS_TPDCTRL_SLVNUM_SLAVE1         (SPI_IXS_TPDCTRL_SLVNUM_SLAVE1_Val << SPI_IXS_TPDCTRL_SLVNUM_Pos) /* (SPI_IXS_TPDCTRL) SLAVE 1 Position  */
#define SPI_IXS_TPDCTRL_SLVNUM_SLAVE2         (SPI_IXS_TPDCTRL_SLVNUM_SLAVE2_Val << SPI_IXS_TPDCTRL_SLVNUM_Pos) /* (SPI_IXS_TPDCTRL) SLAVE 2 Position  */
#define SPI_IXS_TPDCTRL_SLVNUM_SLAVE3         (SPI_IXS_TPDCTRL_SLVNUM_SLAVE3_Val << SPI_IXS_TPDCTRL_SLVNUM_Pos) /* (SPI_IXS_TPDCTRL) SLAVE 3 Position  */
#define SPI_IXS_TPDCTRL_SLVNUM_SLAVE4         (SPI_IXS_TPDCTRL_SLVNUM_SLAVE4_Val << SPI_IXS_TPDCTRL_SLVNUM_Pos) /* (SPI_IXS_TPDCTRL) SLAVE 4 Position  */
#define SPI_IXS_TPDCTRL_Msk                   _UINT32_(0x00000707)                                 /* (SPI_IXS_TPDCTRL) Register Mask  */


/* -------- SPI_IXS_INTENSET : (SPI_IXS Offset: 0x18) (R/W 32) SPI Interrupt Enable Set Register -------- */
#define SPI_IXS_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (SPI_IXS_INTENSET) SPI Interrupt Enable Set Register  Reset Value */

#define SPI_IXS_INTENSET_SPIRXBFEN_Pos        _UINT32_(0)                                          /* (SPI_IXS_INTENSET) Enablie Interrupt Events via SPIRXBF Position */
#define SPI_IXS_INTENSET_SPIRXBFEN_Msk        (_UINT32_(0x1) << SPI_IXS_INTENSET_SPIRXBFEN_Pos)    /* (SPI_IXS_INTENSET) Enablie Interrupt Events via SPIRXBF Mask */
#define SPI_IXS_INTENSET_SPIRXBFEN(value)     (SPI_IXS_INTENSET_SPIRXBFEN_Msk & (_UINT32_(value) << SPI_IXS_INTENSET_SPIRXBFEN_Pos)) /* Assigment of value for SPIRXBFEN in the SPI_IXS_INTENSET register */
#define SPI_IXS_INTENSET_SPITXBEEN_Pos        _UINT32_(4)                                          /* (SPI_IXS_INTENSET) Enablie Interrupt Events via SPITXBE Position */
#define SPI_IXS_INTENSET_SPITXBEEN_Msk        (_UINT32_(0x1) << SPI_IXS_INTENSET_SPITXBEEN_Pos)    /* (SPI_IXS_INTENSET) Enablie Interrupt Events via SPITXBE Mask */
#define SPI_IXS_INTENSET_SPITXBEEN(value)     (SPI_IXS_INTENSET_SPITXBEEN_Msk & (_UINT32_(value) << SPI_IXS_INTENSET_SPITXBEEN_Pos)) /* Assigment of value for SPITXBEEN in the SPI_IXS_INTENSET register */
#define SPI_IXS_INTENSET_FRMERREN_Pos         _UINT32_(15)                                         /* (SPI_IXS_INTENSET) Enable Interrupt Events via FRMERR Position */
#define SPI_IXS_INTENSET_FRMERREN_Msk         (_UINT32_(0x1) << SPI_IXS_INTENSET_FRMERREN_Pos)     /* (SPI_IXS_INTENSET) Enable Interrupt Events via FRMERR Mask */
#define SPI_IXS_INTENSET_FRMERREN(value)      (SPI_IXS_INTENSET_FRMERREN_Msk & (_UINT32_(value) << SPI_IXS_INTENSET_FRMERREN_Pos)) /* Assigment of value for FRMERREN in the SPI_IXS_INTENSET register */
#define SPI_IXS_INTENSET_SPITUREN_Pos         _UINT32_(27)                                         /* (SPI_IXS_INTENSET) Enable Interrupt Events via SPITUR Position */
#define SPI_IXS_INTENSET_SPITUREN_Msk         (_UINT32_(0x1) << SPI_IXS_INTENSET_SPITUREN_Pos)     /* (SPI_IXS_INTENSET) Enable Interrupt Events via SPITUR Mask */
#define SPI_IXS_INTENSET_SPITUREN(value)      (SPI_IXS_INTENSET_SPITUREN_Msk & (_UINT32_(value) << SPI_IXS_INTENSET_SPITUREN_Pos)) /* Assigment of value for SPITUREN in the SPI_IXS_INTENSET register */
#define SPI_IXS_INTENSET_SPIROVEN_Pos         _UINT32_(30)                                         /* (SPI_IXS_INTENSET) Enable Interrupt Events via SPIROV Position */
#define SPI_IXS_INTENSET_SPIROVEN_Msk         (_UINT32_(0x1) << SPI_IXS_INTENSET_SPIROVEN_Pos)     /* (SPI_IXS_INTENSET) Enable Interrupt Events via SPIROV Mask */
#define SPI_IXS_INTENSET_SPIROVEN(value)      (SPI_IXS_INTENSET_SPIROVEN_Msk & (_UINT32_(value) << SPI_IXS_INTENSET_SPIROVEN_Pos)) /* Assigment of value for SPIROVEN in the SPI_IXS_INTENSET register */
#define SPI_IXS_INTENSET_Msk                  _UINT32_(0x48008011)                                 /* (SPI_IXS_INTENSET) Register Mask  */


/* -------- SPI_IXS_INTENCLR : (SPI_IXS Offset: 0x1C) (R/W 32) SPI Interrupt Enable Clear Register -------- */
#define SPI_IXS_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (SPI_IXS_INTENCLR) SPI Interrupt Enable Clear Register  Reset Value */

#define SPI_IXS_INTENCLR_SPIRXBFEN_Pos        _UINT32_(0)                                          /* (SPI_IXS_INTENCLR) Enablie Interrupt Events via SPIRXBF Position */
#define SPI_IXS_INTENCLR_SPIRXBFEN_Msk        (_UINT32_(0x1) << SPI_IXS_INTENCLR_SPIRXBFEN_Pos)    /* (SPI_IXS_INTENCLR) Enablie Interrupt Events via SPIRXBF Mask */
#define SPI_IXS_INTENCLR_SPIRXBFEN(value)     (SPI_IXS_INTENCLR_SPIRXBFEN_Msk & (_UINT32_(value) << SPI_IXS_INTENCLR_SPIRXBFEN_Pos)) /* Assigment of value for SPIRXBFEN in the SPI_IXS_INTENCLR register */
#define SPI_IXS_INTENCLR_SPITXBEEN_Pos        _UINT32_(4)                                          /* (SPI_IXS_INTENCLR) Enablie Interrupt Events via SPITXBE Position */
#define SPI_IXS_INTENCLR_SPITXBEEN_Msk        (_UINT32_(0x1) << SPI_IXS_INTENCLR_SPITXBEEN_Pos)    /* (SPI_IXS_INTENCLR) Enablie Interrupt Events via SPITXBE Mask */
#define SPI_IXS_INTENCLR_SPITXBEEN(value)     (SPI_IXS_INTENCLR_SPITXBEEN_Msk & (_UINT32_(value) << SPI_IXS_INTENCLR_SPITXBEEN_Pos)) /* Assigment of value for SPITXBEEN in the SPI_IXS_INTENCLR register */
#define SPI_IXS_INTENCLR_FRMERREN_Pos         _UINT32_(15)                                         /* (SPI_IXS_INTENCLR) Enable Interrupt Events via FRMERR Position */
#define SPI_IXS_INTENCLR_FRMERREN_Msk         (_UINT32_(0x1) << SPI_IXS_INTENCLR_FRMERREN_Pos)     /* (SPI_IXS_INTENCLR) Enable Interrupt Events via FRMERR Mask */
#define SPI_IXS_INTENCLR_FRMERREN(value)      (SPI_IXS_INTENCLR_FRMERREN_Msk & (_UINT32_(value) << SPI_IXS_INTENCLR_FRMERREN_Pos)) /* Assigment of value for FRMERREN in the SPI_IXS_INTENCLR register */
#define SPI_IXS_INTENCLR_SPITUREN_Pos         _UINT32_(27)                                         /* (SPI_IXS_INTENCLR) Enable Interrupt Events via SPITUR Position */
#define SPI_IXS_INTENCLR_SPITUREN_Msk         (_UINT32_(0x1) << SPI_IXS_INTENCLR_SPITUREN_Pos)     /* (SPI_IXS_INTENCLR) Enable Interrupt Events via SPITUR Mask */
#define SPI_IXS_INTENCLR_SPITUREN(value)      (SPI_IXS_INTENCLR_SPITUREN_Msk & (_UINT32_(value) << SPI_IXS_INTENCLR_SPITUREN_Pos)) /* Assigment of value for SPITUREN in the SPI_IXS_INTENCLR register */
#define SPI_IXS_INTENCLR_SPIROVEN_Pos         _UINT32_(30)                                         /* (SPI_IXS_INTENCLR) Enable Interrupt Events via SPIROV Position */
#define SPI_IXS_INTENCLR_SPIROVEN_Msk         (_UINT32_(0x1) << SPI_IXS_INTENCLR_SPIROVEN_Pos)     /* (SPI_IXS_INTENCLR) Enable Interrupt Events via SPIROV Mask */
#define SPI_IXS_INTENCLR_SPIROVEN(value)      (SPI_IXS_INTENCLR_SPIROVEN_Msk & (_UINT32_(value) << SPI_IXS_INTENCLR_SPIROVEN_Pos)) /* Assigment of value for SPIROVEN in the SPI_IXS_INTENCLR register */
#define SPI_IXS_INTENCLR_Msk                  _UINT32_(0x48008011)                                 /* (SPI_IXS_INTENCLR) Register Mask  */


